# Run this command to install apps inside this file:
# brew bundle

# CLI apps

brew "asdf" # version manager for language runtimes like Node.js
brew "bat" # `cat` with code syntax highlighting
brew "btop" # better `top`
brew "eza" # better `ls` with colors
brew "fastfetch" # display information about your operating system, software and hardware
brew "fd" # find entries in the filesystem.
brew "glow" # MarkDown preview CLI util
brew "grep" # GNU grep (aliased to "ggrep"), egrep and fgrep
brew "gnu-sed" # aliased to "gsed"
brew "icdiff" # diff files with syntax highlighting
brew "fzf" # required for ctrl+r shortcut and zoxide
brew "jq" # JSON processor, run `tldr jq` for usage examples
brew "k9s" # View and manage Kubernetes clusters
brew "kubectl" # Kubernetes CLI
brew "kubecolor" # Colorize your kubectl output
brew "kubectx" # Utility to manage and switch between `kubectl` contexts (package contains "kubens" too)
brew "ncdu" # Disk space analyzer
brew "noti" # Monitor a process and trigger a banner notification, run `tldr noti` for usage examples
brew "jandedobbeleer/oh-my-posh/oh-my-posh" # customizable and fast prompt theme engine for any shell
brew "ripgrep" # Faster alternative to `grep` with code highlighting and other features, `tldr rg`
brew "somo" # Shows open ports being used by services
brew "stern" # Tail multiple pods and containers from Kubernetes,  `tldr stern`
brew "stow" # Symlink manager, often used to manage dotfiles
brew "tlrc" # Replacement for unmaintained tldr package
brew "trash" # Move files/folders to the trash (alternative to rm when you're not sure about deleting permanently)
brew "watch" # Execute a program periodically and monitor the output
brew "wget" # Download files from the Web
brew "zoxide" # Utility to keep track of the most frequently used directories
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# GUI apps

cask_args appdir: "/Applications", require_sha: true

cask "ghostty"
